{
  "backend/main.mo": "Main actor defining Product types with productName and asin fields, ProductAddRequest, search filters, user profiles, and CRUD operations with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms OldProduct (with title field) to NewProduct (with productName and asin fields), mapping title to productName and adding empty asin.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for displaying ASIN prominently, showing product name as primary heading, and updating frontend type definitions.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, including ProductCard which displays productName as primary heading and ASIN with monospace styling, plus Dashboard, filters, and analysis pages.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with meta tags, title for Amazon India Seller Opportunity Finder, and script tag loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard and competitor analysis, wrapped in ThemeProvider and ErrorBoundary with Toaster for notifications.",
  "frontend/src/components/AdvancedFilters.tsx": "Advanced filtering panel managing local filter state with numeric inputs stored as strings, sanitization on apply, comprehensive logging, and reset functionality that triggers data refetch.",
  "frontend/src/components/AlertHistory.tsx": "Scrollable alert history component displaying alerts with icons, titles, messages, timestamps, and read/unread badges for opportunity, competition, keyword, and seasonal alerts.",
  "frontend/src/components/AlertNotifications.tsx": "A notification bell component that displays alerts in a side sheet, showing mock opportunity and competition alerts with unread count badge.",
  "frontend/src/components/CategoryFilter.tsx": "A sidebar filter component that displays category buttons with icons, allowing users to filter products by category or view all categories.",
  "frontend/src/components/CategoryHeatmap.tsx": "Displays a static heatmap image showing opportunity distribution across product categories with a gradient overlay and description.",
  "frontend/src/components/CompetitorCard.tsx": "Renders a card displaying competitor information including rank, price, rating, reviews, listing quality score, and detected weaknesses.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays application errors with reload functionality and detailed stack traces in development mode.",
  "frontend/src/components/Footer.tsx": "Application footer displaying copyright information and a branded link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main navigation header with branding, authentication controls, theme toggle, and subscription tier badge for authenticated users.",
  "frontend/src/components/KeywordResearch.tsx": "Keyword research tool with search input that displays mock data including search volume, difficulty score, CPC estimates, trends, and long-tail keyword suggestions.",
  "frontend/src/components/KeywordTrendChart.tsx": "Line chart component using Recharts to visualize 12-month keyword search trend data.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with header, footer, alert notifications, and conditionally shows profile setup modal for new authenticated users.",
  "frontend/src/components/LoadingStates.tsx": "Displays a grid of skeleton loading cards to show while product data is being fetched.",
  "frontend/src/components/OpportunityLeaderboard.tsx": "Displays a scrollable ranked list of top 10 products sorted by margin, showing product name, category, price, and margin percentage.",
  "frontend/src/components/OpportunityScoreMeter.tsx": "Displays a visual progress meter for opportunity scores (0-100) with color-coded indicators (green for ≥70, yellow for ≥40, red for <40).",
  "frontend/src/components/ProductCard.tsx": "Renders a card displaying product details including price, sales estimates, revenue, margin, rating, BSR, and seller type with color-coded opportunity badges based on margin percentage.",
  "frontend/src/components/ProductGrid.tsx": "Main grid component that fetches and displays products using filters from useProductFilters hook, handles loading/error states, and includes extensive logging for debugging filter and query state changes.",
  "frontend/src/components/ProductSortControls.tsx": "Provides a dropdown select control for sorting products by score, revenue, competition, or growth.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and email, creating a free-tier subscription on submission.",
  "frontend/src/components/ProfitCalculator.tsx": "Two-panel calculator component with input form for selling price, cost, weight, and ads budget, displaying a detailed profit breakdown including Amazon fees and margins.",
  "frontend/src/components/RecommendationBadge.tsx": "Displays a color-coded badge (green/red/yellow) with icon indicating product recommendation status (YES/AVOID/MODERATE).",
  "frontend/src/components/SubscriptionTierBadge.tsx": "Renders a badge showing subscription tier (Free/Pro/Premium) with corresponding icon and color scheme.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with animated transitions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages backend actor creation with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useProductFilters.ts": "Custom hook managing product filter state (category, price, BSR, revenue, ratings, etc.) with sessionStorage persistence and conversion utilities for backend API calls.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for product search, fetching individual products, and managing user profiles with fallback mock data and actor-based backend communication.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark mode) including colors for primary, secondary, destructive, and chart elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CompetitorAnalysis.tsx": "Page component displaying competitor analysis for a specific product, showing top 10 sellers with pricing, ratings, and competitive metrics using mock data.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page orchestrating category filters, advanced filters, and product grid display with filter state management and change handlers.",
  "frontend/src/types/categories.ts": "Defines product categories array with associated Lucide icons for Electronics, Home & Kitchen, Fashion, Sports, and other Amazon marketplace categories.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (INR), numbers (with K/L/Cr suffixes), and dates using Intl API for Indian locale.",
  "frontend/src/utils/profitCalculations.ts": "Calculates Amazon seller profit metrics including referral fees, FBA fees, GST, shipping costs, net profit, ROI percentage, and break-even ACOS.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for an Amazon India Seller Opportunity Finder application, tracking architectural decisions, existing features, known issues (non-working filters and inaccurate product data), and requirements across 29 versions."
}