{
  "backend/main.mo": "Main actor implementing product management, user profiles, access control, and blob storage with types for products, filters, opportunity scores, keyword research, trend detection, profit calculation, and seller analysis.",
  "backend/migration.mo": "Migration module defining old and new actor types for data structure versioning, currently implementing a no-op migration that returns the old actor unchanged.",
  "feature_evidence.json": "Feature evidence report documenting verification of ProductCard component's productName field display with high confidence, linking to test REQ-86.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Dashboard, ProductCard, ProductGrid, filters, and various analysis tools with detailed logging and validation behaviors.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with meta tags, title, and root div for mounting the React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard and competitor analysis, wrapped in ThemeProvider and ErrorBoundary with Toaster for notifications.",
  "frontend/src/components/AdvancedFilters.tsx": "Advanced filtering panel managing numeric filter inputs as strings with sanitization on apply, comprehensive logging, and reset functionality that triggers data refetch.",
  "frontend/src/components/AlertHistory.tsx": "Scrollable list component displaying alert history with icons, badges for unread status, and timestamps for opportunity, competition, keyword, and seasonal alerts.",
  "frontend/src/components/AlertNotifications.tsx": "Sheet-based notification panel with bell icon trigger showing unread count badge and rendering AlertHistory component with mock alert data.",
  "frontend/src/components/CategoryFilter.tsx": "Sidebar card component displaying all Amazon India categories with icons as buttons, highlighting the selected category and including an 'All Categories' option.",
  "frontend/src/components/CategoryHeatmap.tsx": "Displays a static category opportunity heatmap image in a card with a gradient overlay and descriptive text.",
  "frontend/src/components/CompetitorCard.tsx": "Renders a card showing competitor details including rank, price, rating, reviews, listing quality score, and identified weaknesses with badges.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays application errors with reload functionality and development-mode stack traces.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, authentication controls, theme toggle, and subscription tier badge for authenticated users.",
  "frontend/src/components/KeywordResearch.tsx": "Keyword research tool with search input that displays mock data including search volume, difficulty score, CPC estimates, trends, and long-tail keyword suggestions.",
  "frontend/src/components/KeywordTrendChart.tsx": "Line chart component using Recharts to visualize 12-month keyword trend data with monthly labels.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper containing header, footer, alert notifications, and profile setup modal, with conditional rendering based on authentication state.",
  "frontend/src/components/LoadingStates.tsx": "Loading skeleton component that displays a grid of 6 placeholder cards with animated skeleton elements.",
  "frontend/src/components/OpportunityLeaderboard.tsx": "Displays top 10 products sorted by margin in a scrollable leaderboard format with rank, name, category, price, and margin percentage.",
  "frontend/src/components/OpportunityScoreMeter.tsx": "Progress bar component that visualizes an opportunity score from 0-100 with color-coded indicators (green/yellow/red based on score ranges).",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with details like name, ASIN, price, sales estimates, revenue, margin, rating, and opportunity level. Includes debug logging and validation for product data.",
  "frontend/src/components/ProductGrid.tsx": "Renders a grid of product cards using filtered search results from the backend. Handles loading states, errors, filter changes, and validates product data before rendering.",
  "frontend/src/components/ProductSortControls.tsx": "Provides a dropdown select control for sorting products by score, revenue, competition, or growth.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and email, creating a free tier subscription.",
  "frontend/src/components/ProfitCalculator.tsx": "Interactive calculator component that computes profit breakdown for Amazon products based on selling price, cost, weight, and ads budget, displaying fees and margins.",
  "frontend/src/components/RecommendationBadge.tsx": "Displays a colored badge with icon indicating product recommendation status (YES, AVOID, or MODERATE).",
  "frontend/src/components/SubscriptionTierBadge.tsx": "Renders a badge showing the user's subscription tier (Free, Pro, or Premium) with appropriate icon and styling.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes using next-themes, displaying sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation and identity state with delegation validation.",
  "frontend/src/hooks/useProductFilters.ts": "Custom React hook that manages product filter state (category, price, BSR, revenue, ratings, etc.) with sessionStorage persistence and provides helpers to convert filter values to backend-compatible formats including safe parsing of numbers and BigInts.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for product search, fetching individual products, and user profile operations; includes filter sanitization and validation before sending to the backend actor, with serializable query keys for caching.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, muted, destructive, etc.) and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/CompetitorAnalysis.tsx": "Page component that displays detailed competitor analysis for a specific product, showing top 10 sellers with mock data including pricing, ratings, reviews, and listing quality metrics.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that orchestrates product filtering UI with CategoryFilter and AdvancedFilters components in a sidebar, displaying filtered products in a ProductGrid using the useProductFilters hook.",
  "frontend/src/types/categories.ts": "Defines the CATEGORIES constant array mapping product category names to Lucide React icons for 17 Amazon categories including Electronics, Fashion, Beauty, and more.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (INR), numbers (with K/L/Cr suffixes for thousands/lakhs/crores), and dates using Intl formatters for Indian locale.",
  "frontend/src/utils/profitCalculations.ts": "Calculates Amazon FBA profit metrics including referral fees, FBA fees, GST, shipping, packaging costs, net profit per unit, ROI percentage, and break-even ACOS based on selling price, cost, weight, and ads budget.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, container settings, border radius variables, Inter font family, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for Amazon India Seller Opportunity Finder application, documenting architecture (React/Next.js frontend, Node.js/Python backend, PostgreSQL/MongoDB), known issues with ASIN/price/product name accuracy, and extensive feature list including filtering, profit calculation, competitor analysis, and trend detection."
}