{
  "backend/main.mo": "Main Motoko actor implementing product management, user profiles, opportunity scoring, keyword research, profit calculation, and seller analysis with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (category filtering, advanced filters, keyword research, profit calculator) to their corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React components, hooks, and type definitions describing their functionality in the Amazon seller opportunity finder application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard and competitor analysis, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AdvancedFilters.tsx": "Filter panel component with inputs for price range, rating slider, review count, and boolean switches for lightweight, non-branded, low FBA, high growth, and high margin filters.",
  "frontend/src/components/AlertHistory.tsx": "Scrollable list component displaying alert notifications with icons, titles, messages, timestamps, and read/unread badges.",
  "frontend/src/components/AlertNotifications.tsx": "Displays a bell icon button with unread count badge that opens a sheet containing alert history. Uses mock data for opportunity and competition alerts.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a scrollable card with category filter buttons including an 'All Categories' option and individual category buttons with icons. Highlights the selected category.",
  "frontend/src/components/CategoryHeatmap.tsx": "Displays a static heatmap image showing opportunity distribution across categories with a gradient overlay and descriptive text.",
  "frontend/src/components/CompetitorCard.tsx": "Shows competitor details including rank, seller name, price, rating, reviews, listing quality score, and detected weaknesses as badges.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright notice and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, theme toggle, subscription tier badge, user profile name, and login/logout button. Handles Internet Identity authentication.",
  "frontend/src/components/KeywordResearch.tsx": "Provides keyword research interface with search input, displays mock metrics (search volume, difficulty, CPC), trend chart, and long-tail keyword suggestions.",
  "frontend/src/components/KeywordTrendChart.tsx": "Renders a line chart showing 12-month keyword trend data using Recharts library with responsive container.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper containing Header, AlertNotifications, page content outlet, Footer, and conditionally shows ProfileSetupModal for authenticated users without profiles.",
  "frontend/src/components/LoadingStates.tsx": "Displays a grid of 6 skeleton loading cards with placeholder content for header, image, and text lines.",
  "frontend/src/components/OpportunityLeaderboard.tsx": "Shows top 10 products sorted by margin in a scrollable list with rank badges, product titles, categories, prices, and margin percentages.",
  "frontend/src/components/OpportunityScoreMeter.tsx": "Displays an opportunity score as a progress bar with color coding (green/yellow/red) based on score thresholds and numeric value display.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, pricing, sales estimates, ratings, competition level, opportunity score meter, and recommendation badge; includes navigation to product details and calculates revenue and rising star status.",
  "frontend/src/components/ProductGrid.tsx": "Renders a grid of product cards with sorting controls and category filtering; displays an alert when no products are found.",
  "frontend/src/components/ProductSortControls.tsx": "Provides a dropdown select control to sort products by score, revenue, competition, or growth.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name and email, and saving with a free subscription tier.",
  "frontend/src/components/ProfitCalculator.tsx": "Interactive calculator with input fields for selling price, cost, weight, and ads budget; displays detailed profit breakdown including Amazon fees, FBA fees, and net profit.",
  "frontend/src/components/RecommendationBadge.tsx": "Displays a colored badge with icon indicating product recommendation status (YES, AVOID, or MODERATE).",
  "frontend/src/components/SubscriptionTierBadge.tsx": "Renders a badge showing user subscription tier (Free, Pro, or Premium) with corresponding icon and styling.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes with animated sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing AuthClient lifecycle and identity state with delegation validation.",
  "frontend/src/hooks/useProductFilters.ts": "Custom hook managing advanced product filters state with session storage persistence, including price range, ratings, BSR, revenue, and various boolean preferences.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, products, opportunity scores, and search results using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CompetitorAnalysis.tsx": "Displays competitor analysis for a specific product, showing top 10 sellers with mock data including pricing, ratings, and weaknesses.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for products, opportunities, heatmap, keywords, and profit calculator; shows hero section for unauthenticated users.",
  "frontend/src/types/categories.ts": "Exports an array of product categories with associated Lucide icons for use throughout the application.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency in INR, numbers with Indian notation (Cr/L/K), and dates.",
  "frontend/src/utils/profitCalculations.ts": "Calculates Amazon seller profit metrics including referral fees, FBA fees, GST, shipping, and ROI based on product pricing and weight inputs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space, extended theme with container settings, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting an Amazon India Seller Opportunity Finder application with full-stack architecture (React/Next.js frontend, Node.js/Python backend, PostgreSQL/MongoDB), existing features for product analysis, filtering, profit calculation, and comprehensive requirements for seller opportunity identification across all Amazon.in categories."
}