{
  "backend/main.mo": "Main Motoko actor defining product management system with types for products, filters, opportunity scoring, and user profiles; includes mixins for storage and authorization, and maps for products and user profiles with query/update functions.",
  "feature_evidence.json": "Feature evidence report documenting four debugging and data extraction features for ProductGrid.tsx and useQueries.ts, all with high confidence and linked to test requirements REQ-64, REQ-65, REQ-67.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, layout, filters, product display, analytics tools, and UI elements with their key responsibilities and data flows.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements, charts, sidebar, and semantic tokens using oklch color space.",
  "frontend/index.html": "HTML entry point with meta tags for the Amazon India Seller Opportunity Finder application, loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard and competitor analysis, wrapped in ThemeProvider, ErrorBoundary, and Toaster for notifications.",
  "frontend/src/components/AdvancedFilters.tsx": "Advanced filtering panel component managing local filter state with numeric inputs stored as strings, providing apply/reset functionality and sanitizing values before propagating changes to parent.",
  "frontend/src/components/AlertHistory.tsx": "Scrollable alert history list component displaying alerts with type-specific icons, read/unread status badges, and formatted timestamps.",
  "frontend/src/components/AlertNotifications.tsx": "Displays a bell icon button with unread count badge that opens a sheet containing alert history. Uses mock alert data for opportunities and competition changes.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a card with category filter buttons including an \"All Categories\" option and individual category buttons with icons. Highlights the currently selected category.",
  "frontend/src/components/CategoryHeatmap.tsx": "Displays a static heatmap image showing opportunity distribution across categories with a gradient overlay and descriptive text.",
  "frontend/src/components/CompetitorCard.tsx": "Shows competitor details including rank, seller name, price, rating, reviews, listing quality score, and detected weaknesses in a card layout.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches errors, displays a user-friendly error message with recovery options, and shows technical details in development mode.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright notice and a \"Built with caffeine.ai\" attribution link with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main header component with logo, theme toggle, subscription tier badge, and login/logout button. Handles Internet Identity authentication and navigation.",
  "frontend/src/components/KeywordResearch.tsx": "Keyword research tool with search input that displays mock data including search volume, difficulty score, CPC estimate, trend chart, and long-tail keyword suggestions.",
  "frontend/src/components/KeywordTrendChart.tsx": "Renders a 12-month line chart using Recharts to visualize keyword search volume trends over time.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with header, footer, alert notifications, and profile setup modal. Conditionally shows profile setup for authenticated users without profiles.",
  "frontend/src/components/LoadingStates.tsx": "Displays a grid of skeleton loading cards (6 items) with placeholder content for product listings during data fetching.",
  "frontend/src/components/OpportunityLeaderboard.tsx": "Shows top 10 products sorted by margin in a scrollable leaderboard format with rank, title, category, price, and margin percentage.",
  "frontend/src/components/OpportunityScoreMeter.tsx": "Displays a visual progress meter for product opportunity scores (0-100) with color-coded indicators (green/yellow/red) based on score thresholds.",
  "frontend/src/components/ProductCard.tsx": "Renders a card displaying product details including image, price, sales estimates, revenue, margin, rating, competition level, opportunity score meter, and recommendation badge with navigation to product details.",
  "frontend/src/components/ProductGrid.tsx": "Main grid component that fetches and displays products using filters, includes TEST_MODE for mock data, handles loading/error states, and shows filter reset controls.",
  "frontend/src/components/ProductSortControls.tsx": "Provides a dropdown select control for sorting products by score, revenue, competition, or growth.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and email, creating a free-tier subscription on submission.",
  "frontend/src/components/ProfitCalculator.tsx": "Two-panel calculator component with input form for selling price, cost, weight, and ads budget, displaying detailed profit breakdown including Amazon fees and net profit.",
  "frontend/src/components/RecommendationBadge.tsx": "Displays a colored badge with icon indicating product recommendation status (YES/AVOID/MODERATE).",
  "frontend/src/components/SubscriptionTierBadge.tsx": "Renders a badge showing user subscription tier (Free/Pro/Premium) with corresponding icon and styling.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes with animated sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages backend actor creation with Internet Identity authentication, handles anonymous/authenticated states, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useProductFilters.ts": "Custom hook managing product filter state (category, price, BSR, revenue, ratings, etc.) with session storage persistence and helper functions to convert filters to backend-compatible format.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for product search, fetching individual products, and mutations, with fallback mock data and proper BigInt/type handling for backend communication.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, including primary, secondary, muted, destructive, and chart color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CompetitorAnalysis.tsx": "Page displaying competitor analysis for a specific product, showing top 10 sellers with mock data including pricing, ratings, reviews, and listing quality metrics.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page combining category filters, advanced filters, and product grid to display Amazon India product opportunities.",
  "frontend/src/types/categories.ts": "Defines product categories array with names and associated Lucide icons for Electronics, Home & Kitchen, Fashion, Sports, and other Amazon categories.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (INR), numbers (with K/L/Cr abbreviations), and dates using Intl API.",
  "frontend/src/utils/profitCalculations.ts": "Calculates Amazon seller profit metrics including referral fees, FBA fees, GST, shipping, packaging costs, net profit, ROI, and break-even ACOS.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and design tokens for a component-based UI system.",
  "project_state.json": "Project metadata for an Amazon India Seller Opportunity Finder application, documenting architecture (React/Node.js/PostgreSQL stack), existing features (filtering, profit calculation, competitor analysis), and a known issue where ProductGrid displays no products despite resolved serialization errors."
}