{
  "backend/main.mo": "Main backend actor defining product data types, user profiles, subscription tiers, and business logic for Amazon India seller opportunity finder with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to investigating and resolving 'Something went wrong!' errors in ProductGrid component and backend query handling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including dashboard, filters, product display, authentication, and query management with error handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard and competitor analysis, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AdvancedFilters.tsx": "Advanced filtering panel with inputs for price range, rating, reviews, BSR, revenue, and boolean toggles, with comprehensive debug logging and state management via useProductFilters hook.",
  "frontend/src/components/AlertHistory.tsx": "Scrollable list component displaying alert notifications with icons, timestamps, read/unread status, and type-specific styling.",
  "frontend/src/components/AlertNotifications.tsx": "Bell icon button with unread badge count that opens a sheet displaying alert history with mock data for opportunity and competition alerts.",
  "frontend/src/components/CategoryFilter.tsx": "A sidebar component that displays a scrollable list of category buttons for filtering products, with an 'All Categories' option and icons for each category.",
  "frontend/src/components/CategoryHeatmap.tsx": "Displays a static heatmap image showing opportunity distribution across product categories with a gradient overlay and descriptive text.",
  "frontend/src/components/CompetitorCard.tsx": "Shows competitor information including rank, seller name, price, rating, reviews, listing quality score, and detected weaknesses in a card layout.",
  "frontend/src/components/Footer.tsx": "A footer component displaying copyright information and a 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Main navigation header with app logo, theme toggle, subscription tier badge, user profile display, and login/logout functionality using Internet Identity authentication.",
  "frontend/src/components/KeywordResearch.tsx": "A keyword research tool with search input that displays mock data including search volume, difficulty score, CPC estimates, trend charts, and long-tail keyword suggestions.",
  "frontend/src/components/KeywordTrendChart.tsx": "Renders a 12-month line chart visualization of keyword search trends using Recharts library.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps the app with Header, Footer, AlertNotifications, and conditionally shows ProfileSetupModal for authenticated users without profiles.",
  "frontend/src/components/LoadingStates.tsx": "Displays a grid of skeleton loading placeholders (6 cards) with animated shimmer effects for product cards.",
  "frontend/src/components/OpportunityLeaderboard.tsx": "Shows a scrollable ranked list of the top 10 products sorted by margin, displaying title, category, price, and margin percentage for each.",
  "frontend/src/components/OpportunityScoreMeter.tsx": "A progress bar component that visualizes an opportunity score from 0-100 with color-coded indicators (green/yellow/red based on score ranges).",
  "frontend/src/components/ProductCard.tsx": "Comprehensive product card displaying image, title, category, price, sales estimates, revenue, margin, rating, competition level, opportunity score meter, and recommendation badge with navigation to product details.",
  "frontend/src/components/ProductGrid.tsx": "Displays a grid of product cards with sorting controls, loading states, and comprehensive error handling with troubleshooting guidance. Includes collapsible technical details for debugging and logs rendering state in development mode.",
  "frontend/src/components/ProductSortControls.tsx": "Provides a dropdown select component to sort products by score, revenue, competition, or growth with an icon indicator.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name and email, saving to backend with a free subscription tier by default.",
  "frontend/src/components/ProfitCalculator.tsx": "Interactive calculator component with input fields for selling price, cost, weight, and ads budget that computes and displays profit breakdown including Amazon fees.",
  "frontend/src/components/RecommendationBadge.tsx": "Displays a colored badge with icon indicating product recommendation status (YES/AVOID/MODERATE) using green, red, or yellow styling.",
  "frontend/src/components/SubscriptionTierBadge.tsx": "Renders a badge showing user subscription tier (Free/Pro/Premium) with corresponding icon and color scheme.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between light and dark themes with animated sun/moon icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useProductFilters.ts": "Hook managing product search filters state with session storage persistence, handling bigint serialization for review counts and BSR ranges.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, products, and opportunity scores, with comprehensive error handling and logging for backend actor interactions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI components using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/CompetitorAnalysis.tsx": "Displays competitor analysis for a specific product, showing top 10 sellers with mock data including pricing, ratings, and listing quality metrics.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabs for product browsing, opportunity leaderboard, category heatmap, keyword research, and profit calculator; handles authentication, filtering, and product search.",
  "frontend/src/types/categories.ts": "Defines an array of product categories with associated Lucide icons for use throughout the application UI.",
  "frontend/src/utils/formatters.ts": "Provides utility functions for formatting currency (INR), numbers (with K/L/Cr suffixes), and dates in Indian locale format.",
  "frontend/src/utils/profitCalculations.ts": "Calculates Amazon FBA profit metrics including referral fees, FBA fees, GST, shipping, packaging costs, net profit, ROI, and break-even ACOS.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space with CSS variables, extended theme settings including container, border radius, fonts (Inter), animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for Amazon India Seller Opportunity Finder application, tracking architectural decisions (React/Next.js frontend, Node.js/Python backend, PostgreSQL/MongoDB), existing features (category filtering, profit calculator, competitor analysis), known issues (filter error handling), and requirement mappings."
}